Revit 2027 API
BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTagUpgrade Property
 During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementCategoryChangeInvalidatesTagUpgrade { get; }
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTagUpgrade As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTagUpgrade {
	FailureDefinitionId^ get ();
}
static member ElementCategoryChangeInvalidatesTagUpgrade : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TagFailures Class
Autodesk.Revit.DB Namespace